# а.) Створення початкового списку
list = [23, 4, -3, 40, 5]

# Розширення списку, додавши до нього всі елементи списку L[3, 6, 7]
list.extend([3, 6, 7])

# б.) Вставка значення 33333 на другий елемент
list.insert(1, 33333)

# в.) Розташування списку у зворотньому порядку
list.reverse()

# г.) Додавання 3 до кінця списку
list.append(3)

# д.) Видалення першого елемента списку, який має значення 3
list.remove(3)

# е.) Розташування списку у порядку збільшення
list.sort()

# ж.) Очищення списку
list.clear()

print("список:", list)
